AUTO_config_TK_pesok/src/Documents/Антимонопольный/Антимонопольный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Антимонопольный</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АкцизнаяГруппа</name>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаОтчета</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаОтчета1</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТеретории</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮрАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКПО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаОтчета2</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТеретории</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮрАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКПО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаОтчета3</name>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходПроизводитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходОпт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходИмпорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходОпт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходЭкспорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонец</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасходПоОтчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходПоОтчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/ВидыДвижений/ВидыДвижений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвижений</name>
  <comment>Виды движений</comment>
  <enumValues>
    <name>Приход</name>
    <comment>Приход</comment>
  </enumValues>
  <enumValues>
    <name>Расход</name>
    <comment>Расход</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее движения</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>ОсновнойКонтрагент</name>
      <description>Основной контрагент</description>
    </items>
    <items>
      <name>ЧастноеЛицо</name>
      <description>Частное лицо</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование контрагента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <comment>Вид контрагента</comment>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Дополнительная информация о контрагенте</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодWERA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРаботы</name>
    <comment>1 - Корректировка 2 - Замена накладных</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерТабак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/Антимонопольный/ManagerModule.bsl
Процедура ЗполнитьДанныеПоПриходам(ДанныеДокумента,ТабличнаяЧасть) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТабличнаяЧасть.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровТовары.Ссылка.Контрагент КАК Контрагент,
		|	ПоступлениеТоваровТовары.Номенклатура.АкцизГруппа КАК ГруппаАкциза,
		|	СУММА(ПоступлениеТоваровТовары.КоличествоБазовое) КАК КоличествоБазовое,
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0) КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ПоступлениеТоваровТовары.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	ПоступлениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеТоваровТовары.Ссылка.Проведен
		|	И ПоступлениеТоваровТовары.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|	И ПоступлениеТоваровТовары.Ссылка.ДоговорВзаиморасчетов.Организация = &Организация
		|	И ПоступлениеТоваровТовары.Ссылка.РегламентированныйУчет
		//|	И НЕ ПоступлениеТоваровТовары.Ссылка.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровТовары.Номенклатура.АкцизГруппа,
		|	ПоступлениеТоваровТовары.Ссылка.Контрагент,
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратПоставщикуТовары.Ссылка.Контрагент,
		|	ВозвратПоставщикуТовары.Номенклатура.АкцизГруппа,
		|	СУММА(-ВозвратПоставщикуТовары.КоличествоБазовое),
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|ИЗ
		|	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВозвратПоставщикуТовары.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	ВозвратПоставщикуТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратПоставщикуТовары.Ссылка.Проведен
		|	И ВозвратПоставщикуТовары.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|	И ВозвратПоставщикуТовары.Ссылка.ДоговорВзаиморасчетов.Организация = &Организация
		|	И ВозвратПоставщикуТовары.Ссылка.РегламентированныйУчет
		//|	И НЕ ВозвратПоставщикуТовары.Ссылка.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратПоставщикуТовары.Ссылка.Контрагент,
		|	ВозвратПоставщикуТовары.Номенклатура.АкцизГруппа,
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Контрагент,
		|	КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа,
		|	СУММА(КонсолидированныеОстаткиОрганизацииСостав.КоличествоБазовое),
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|ИЗ
		|	Документ.КонсолидированныеОстаткиОрганизации.Товары КАК КонсолидированныеОстаткиОрганизацииСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО КонсолидированныеОстаткиОрганизацииСостав.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Проведен
		|	И КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Организация = &Организация
		|	И КонсолидированныеОстаткиОрганизацииСостав.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|	И КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|
		|СГРУППИРОВАТЬ ПО
		|	КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа,
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Контрагент,
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Контрагент,
		|	КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа,
		|	СУММА(КонсолидированныеОстаткиОрганизацииСостав.КоличествоБазовое),
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|ИЗ
		|	Документ.КонсолидированныеОстаткиОрганизации.Товары КАК КонсолидированныеОстаткиОрганизацииСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО КонсолидированныеОстаткиОрганизацииСостав.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Проведен
		|	И КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Организация = &Организация
		|	И КонсолидированныеОстаткиОрганизацииСостав.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	И КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|	И КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Комментарий ПОДОБНО ""Возвраты""
		|
		|СГРУППИРОВАТЬ ПО
		|	КонсолидированныеОстаткиОрганизацииСостав.Номенклатура.АкцизГруппа,
		|	КонсолидированныеОстаткиОрганизацииСостав.Ссылка.Контрагент,
		|	ЕСТЬNULL(ДополнительныеСведения.Значение, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоПериода КАК Дата,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.Контрагент.КодПоЕДРПОУ КАК ОКПО,
		|	ВложенныйЗапрос.ГруппаАкциза КАК ГруппаАкциза,
		|	ВложенныйЗапрос.ГруппаАкциза.Код КАК КодАМ,
		|	0 КАК КоличествоПриход,
		|	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоБазовое,
		|	ВложенныйЗапрос.Коэффициент КАК Коэффициент,
		|	ВложенныйЗапрос.ГруппаАкциза.Формула КАК Формула,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ГруппаАкциза.Родитель = &АкцизГруппа
		|			ТОГДА ВложенныйЗапрос.ГруппаАкциза
		|		ИНАЧЕ ВложенныйЗапрос.ГруппаАкциза.Родитель
		|	КОНЕЦ КАК Группа,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК ЮрАдрес,
		|	ДополнительныеСведения.Значение КАК КодТеретории
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Товары.Контрагент КАК Контрагент,
		|		ВТ_Товары.ГруппаАкциза КАК ГруппаАкциза,
		|		СУММА(ВТ_Товары.КоличествоБазовое) КАК КоличествоБазовое,
		|		ВТ_Товары.Коэффициент КАК Коэффициент
		|	ИЗ
		|		ВТ_Товары КАК ВТ_Товары
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Товары.Контрагент,
		|		ВТ_Товары.ГруппаАкциза,
		|		ВТ_Товары.Коэффициент) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО ВложенныйЗапрос.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойинформации.Адрес))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВложенныйЗапрос.Контрагент = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Контрагенты)
		|			И (ДополнительныеСведения.Свойство.Имя = ""КодТеритории"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Товары";
	
	
	Запрос.УстановитьПараметр("АкцизГруппа", ДанныеДокумента.АкцизнаяГруппа);
	//Запрос.УстановитьПараметр("ЕдИзмеренияПоКлассификатору", ДанныеДокумента.ЕдИзмеренияПоКлассификатору);
	Запрос.УстановитьПараметр("КонецПериода", ДанныеДокумента.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеДокумента.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ тзРезультат Цикл 
		Результат = 0;
		Количество = Стр.КоличествоБазовое;
		Коф =  Стр.Коэффициент;
		Выполнить(стр.Формула);
		//Результат = Результат/1000;
		Стр.КоличествоПриход = Результат;
	КонецЦикла;
	
	тзРезультат.Свернуть("Группа,ГруппаАкциза,Дата,КодАМ,Контрагент,КодТеретории,ОКПО,ЮрАдрес","КоличествоПриход");	

	тзГруппы = тзРезультат.Скопировать();
	тзГруппы.Свернуть("Группа,Дата,Контрагент,КодТеретории,ОКПО,ЮрАдрес");
	Для Каждого сГруппа Из тзГруппы Цикл 
	
		массивСтрок = тзРезультат.НайтиСтроки(Новый Структура("Группа,Контрагент",сГруппа.Группа,сГруппа.Контрагент));
		
		тзКопияГруппы = тзРезультат.Скопировать(массивСтрок,"КоличествоПриход");
		СуммаГруппы = тзКопияГруппы.Итог("КоличествоПриход");
		нСтрока = тзРезультат.НайтиСтроки(Новый Структура("ГруппаАкциза,Контрагент",сГруппа.Группа,сГруппа.Контрагент));
		Если нСтрока.Количество() = 0 Тогда
			СтрокаРезультата = тзРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,сГруппа);
			СтрокаРезультата.КодАМ =  сГруппа.Группа.Код;
			СтрокаРезультата.КоличествоПриход   = СуммаГруппы;
		Иначе
			нСтрока[0].КоличествоПриход  = СуммаГруппы;
		КонецЕсли;
	КонецЦикла;
	тзРезультат.Сортировать("Контрагент Возр,КодАМ Возр");
	//
	ТабличнаяЧасть.Загрузить(тзРезультат);
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	
КонецПроцедуры

Процедура ЗполнитьДанныеПоРасходам(ДанныеДокумента,ТабличнаяЧасть) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТабличнаяЧасть.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяНакладнаяТовары.Ссылка.Контрагент КАК Контрагент,
		|	НалоговаяНакладнаяТовары.Номенклатура.АкцизГруппа КАК НоменклатураАкцизГруппа,
		|	СУММА(НалоговаяНакладнаяТовары.КоличествоБазовое) КАК КоличествоБазовое,
		|	ДополнительныеСведения.Значение КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ТК_НалоговаяНакладная.Товары КАК НалоговаяНакладнаяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО НалоговаяНакладнаяТовары.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	НалоговаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НалоговаяНакладнаяТовары.Ссылка.Проведен
		|	И НалоговаяНакладнаяТовары.Ссылка.Организация = &Организация
		|	И НалоговаяНакладнаяТовары.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|	И НЕ НалоговаяНакладнаяТовары.Ссылка.ХозОперация В (&ХозОперация)
		|
		|СГРУППИРОВАТЬ ПО
		|	НалоговаяНакладнаяТовары.Номенклатура.АкцизГруппа,
		|	НалоговаяНакладнаяТовары.Ссылка.Контрагент,
		|	ДополнительныеСведения.Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Приложение2КНалоговойНакладнойТовары.Ссылка.Контрагент,
		|	Приложение2КНалоговойНакладнойТовары.Номенклатура.АкцизГруппа,
		|	СУММА(Приложение2КНалоговойНакладнойТовары.ИзменениеКоличество * Приложение2КНалоговойНакладнойТовары.ЕдиницаИзмерения.Коэффициент),
		|	ДополнительныеСведения.Значение
		|ИЗ
		|	Документ.ТК_Приложение2КНалоговойНакладной.Товары КАК Приложение2КНалоговойНакладнойТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО Приложение2КНалоговойНакладнойТовары.Номенклатура = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|			И (НЕ ДополнительныеСведения.Значение = 0)
		|ГДЕ
		|	Приложение2КНалоговойНакладнойТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Приложение2КНалоговойНакладнойТовары.Ссылка.Проведен
		|	И Приложение2КНалоговойНакладнойТовары.Ссылка.Организация = &Организация
		|	И Приложение2КНалоговойНакладнойТовары.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|	И Приложение2КНалоговойНакладнойТовары.ИзменениеКоличество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Приложение2КНалоговойНакладнойТовары.Ссылка.Контрагент,
		|	Приложение2КНалоговойНакладнойТовары.Номенклатура.АкцизГруппа,
		|	ДополнительныеСведения.Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&НачалоПериода КАК Дата,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК ЮрАдрес,
		|	ВложенныйЗапрос.Контрагент.КодПоЕДРПОУ КАК ОКПО,
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа КАК ГруппаАкциза,
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа.Код КАК КодАМ,
		|	0 КАК КоличествоРасход,
		|	ВложенныйЗапрос.Коэффициент КАК Коэффициент,
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа.Формула КАК Формула,
		|	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоБазовое,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.НоменклатураАкцизГруппа.Родитель = &АкцизГруппа
		|			ТОГДА ВложенныйЗапрос.НоменклатураАкцизГруппа
		|		ИНАЧЕ ВложенныйЗапрос.НоменклатураАкцизГруппа.Родитель
		|	КОНЕЦ КАК Группа,
		|	ДополнительныеСведения.Значение КАК КодТеретории
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Товары.Контрагент КАК Контрагент,
		|		ВТ_Товары.НоменклатураАкцизГруппа КАК НоменклатураАкцизГруппа,
		|		СУММА(ВТ_Товары.КоличествоБазовое) КАК КоличествоБазовое,
		|		ВТ_Товары.Коэффициент КАК Коэффициент
		|	ИЗ
		|		ВТ_Товары КАК ВТ_Товары
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Товары.НоменклатураАкцизГруппа,
		|		ВТ_Товары.Контрагент,
		|		ВТ_Товары.Коэффициент) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО ВложенныйЗапрос.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
		|			И (КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойинформации.Адрес))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВложенныйЗапрос.Контрагент = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Контрагенты)
		|			И (ДополнительныеСведения.Свойство.Имя = ""КодТеритории"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Товары";
	
	
	Запрос.УстановитьПараметр("АкцизГруппа", ДанныеДокумента.АкцизнаяГруппа);
	//Запрос.УстановитьПараметр("ЕдИзмеренияПоКлассификатору", ДанныеДокумента.ЕдИзмеренияПоКлассификатору);
	Запрос.УстановитьПараметр("КонецПериода", ДанныеДокумента.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеДокумента.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	СписокХо = Новый СписокЗначений;
	СписокХо.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяАктУслуг);
	СписокХо.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяРозничнаяПродажа);
	Запрос.УстановитьПараметр("ХозОперация", СписокХо);

	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ тзРезультат Цикл 
		Результат = 0;
		Количество = Стр.КоличествоБазовое;
		Коф =  Стр.Коэффициент;
		Выполнить(стр.Формула);
		//Результат = Результат/1000;
		Стр.КоличествоРасход = Результат;
	КонецЦикла;
	тзРезультат.Свернуть("Группа,ГруппаАкциза,Дата,КодАМ,КодТеретории,Контрагент,ОКПО,ЮрАдрес","КоличествоРасход");	
	
	тзГруппы = тзРезультат.Скопировать();
	тзГруппы.Свернуть("Группа,КодТеретории,Дата,Контрагент,ОКПО,ЮрАдрес");
	Для Каждого сГруппа Из тзГруппы Цикл 
		
		массивСтрок = тзРезультат.НайтиСтроки(Новый Структура("Группа,Контрагент",сГруппа.Группа,сГруппа.Контрагент));
		
		тзКопияГруппы = тзРезультат.Скопировать(массивСтрок,"КоличествоРасход");
		СуммаГруппы = тзКопияГруппы.Итог("КоличествоРасход");
		нСтрока = тзРезультат.НайтиСтроки(Новый Структура("ГруппаАкциза,Контрагент",сГруппа.Группа,сГруппа.Контрагент));
		Если нСтрока.Количество() = 0 Тогда
			СтрокаРезультата = тзРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,сГруппа);
			СтрокаРезультата.КодАМ =  сГруппа.Группа.Код;
			СтрокаРезультата.КоличествоРасход   = СуммаГруппы;
		Иначе
			нСтрока[0].КоличествоРасход  = СуммаГруппы;
		КонецЕсли;
	КонецЦикла;
	тзРезультат.Сортировать("Контрагент Возр,КодАМ Возр");
	
	ТабличнаяЧасть.Загрузить(тзРезультат);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	
КонецПроцедуры


Процедура ЗполнитьДанныеПоРознице(ДанныеДокумента,ТабличнаяЧасть) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗКСТовары.Номенклатура КАК Номенклатура,
		|	ЗКСТовары.Номенклатура.АкцизГруппа КАК НоменклатураАкцизГруппа,
		|	СУММА(ЗКСТовары.КоличествоБазовое) КАК КоличествоБазовое,
		|	СУММА(ЗКСТовары.СуммаВсего) КАК СуммаВсего
		|ПОМЕСТИТЬ ВТ_Продажи
		|ИЗ
		|	Документ.ТК_ЗакрытиеСменыЗКС.Товары КАК ЗКСТовары
		|ГДЕ
		|	ЗКСТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗКСТовары.Ссылка.Проведен
		|	И ЗКСТовары.Ссылка.Организация = &Организация
		|	И ЗКСТовары.Номенклатура.АкцизГруппа В ИЕРАРХИИ(&АкцизГруппа)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗКСТовары.Номенклатура.АкцизГруппа,
		|	ЗКСТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа КАК НоменклатураАкцизГруппа,
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа.Код КАК КодАМ,
		|	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоБазовое,
		|	0 КАК Поле1,
		|	ВложенныйЗапрос.СуммаВсего КАК СуммаВсего,
		|	ВложенныйЗапрос.НоменклатураАкцизГруппа.Формула КАК Формула,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.НоменклатураАкцизГруппа.Родитель = &АкцизГруппа
		|			ТОГДА ВложенныйЗапрос.НоменклатураАкцизГруппа
		|		ИНАЧЕ ВложенныйЗапрос.НоменклатураАкцизГруппа.Родитель
		|	КОНЕЦ КАК Группа,
		|	ВложенныйЗапрос.Коэффициент КАК Коэффициент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Продажи.НоменклатураАкцизГруппа КАК НоменклатураАкцизГруппа,
		|		СУММА(ВТ_Продажи.КоличествоБазовое) КАК КоличествоБазовое,
		|		СУММА(ВТ_Продажи.СуммаВсего) КАК СуммаВсего,
		|		ДополнительныеСведения.Значение КАК Коэффициент
		|	ИЗ
		|		ВТ_Продажи КАК ВТ_Продажи
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|			ПО ВТ_Продажи.Номенклатура = ДополнительныеСведения.Объект
		|				И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|				И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
		|				И (НЕ ДополнительныеСведения.Значение = 0)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Продажи.НоменклатураАкцизГруппа,
		|		ДополнительныеСведения.Значение) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Продажи";
	
	Запрос.УстановитьПараметр("АкцизГруппа", ДанныеДокумента.АкцизнаяГруппа);
	//Запрос.УстановитьПараметр("ЕдИзмеренияПоКлассификатору", ДанныеДокумента.ЕдИзмеренияПоКлассификатору);
	Запрос.УстановитьПараметр("КонецПериода", ДанныеДокумента.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеДокумента.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	ТабличнаяЧасть.Колонки.Добавить("Группа");
	ТабличнаяЧасть.Колонки.Добавить("ГруппаАкциза");
	Пока Выборка.Следующий() Цикл 
		нСтрока = ТабличнаяЧасть.Добавить();
		
		Результат = 0;
		Количество = Выборка.КоличествоБазовое;
		Коф =  Выборка.Коэффициент;
		Выполнить(Выборка.Формула);
		//Результат = Результат/1000;
		
		нСтрока.КодАМ         = СокрЛП(Выборка.КодАМ);
		нСтрока.РасходРозница = Результат;//Выборка.ОбъемКоличество;
		нСтрока.КоличествоРасходПоОтчету = Результат;//Выборка.ОбъемКоличество;
		нСтрока.КоличествоРасход = Результат;//Выборка.ОбъемКоличество;
		нСтрока.СуммаРасходПоОтчету = Выборка.СуммаВсего;
		нСтрока.СуммаРасход = Выборка.СуммаВсего;
		нСтрока.Группа = Выборка.Группа;
		нСтрока.ГруппаАкциза = Выборка.НоменклатураАкцизГруппа;

	КонецЦикла;
	
	//Данченко О.Ю. 06.04.18
	ТабличнаяЧасть.Свернуть("Группа,ГруппаАкциза,КодАМ","КоличествоРасход,КоличествоРасходПоОтчету,ОстатокНаКонец,ОстатокНаНачало,ПриходВсего,ПриходИмпорт,ПриходОпт,ПриходПроизводитель,РасходВсего,РасходОпт,РасходРозница,РасходЭкспорт,СуммаРасходПоОтчету,СуммаРасход");	
	//Данченко О.Ю. 06.04.18

		
	тзГруппы = ТабличнаяЧасть.Скопировать();
	тзГруппы.Свернуть("Группа");
	Для Каждого сГруппа Из тзГруппы Цикл 
		
		массивСтрок = ТабличнаяЧасть.НайтиСтроки(Новый Структура("Группа",сГруппа.Группа));
		
		тзКопияГруппы = ТабличнаяЧасть.Скопировать(массивСтрок,"РасходРозница,КоличествоРасходПоОтчету,КоличествоРасход,СуммаРасходПоОтчету,СуммаРасход");
		
		РасходРозницаГруппы = тзКопияГруппы.Итог("РасходРозница");
		КоличествоРасходПоОтчетуГруппы = тзКопияГруппы.Итог("КоличествоРасходПоОтчету");
		КоличествоРасходГруппы = тзКопияГруппы.Итог("КоличествоРасход");
		СуммаРасходПоОтчетуГруппы = тзКопияГруппы.Итог("СуммаРасходПоОтчету");
		СуммаРасходГруппы = тзКопияГруппы.Итог("СуммаРасход");

		нСтрока = ТабличнаяЧасть.НайтиСтроки(Новый Структура("ГруппаАкциза",сГруппа.Группа));
		Если нСтрока.Количество() = 0 Тогда
			СтрокаРезультата = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата,сГруппа);
			СтрокаРезультата.КодАМ =  сГруппа.Группа.Код;
			СтрокаРезультата.РасходРозница   = РасходРозницаГруппы;
			СтрокаРезультата.КоличествоРасходПоОтчету   = КоличествоРасходПоОтчетуГруппы;
			СтрокаРезультата.КоличествоРасход   = КоличествоРасходГруппы;
			СтрокаРезультата.СуммаРасходПоОтчету   = СуммаРасходПоОтчетуГруппы;
			СтрокаРезультата.СуммаРасход   = СуммаРасходГруппы;
		Иначе
			нСтрока[0].РасходРозница  = РасходРозницаГруппы;
			нСтрока[0].КоличествоРасходПоОтчету  = КоличествоРасходПоОтчетуГруппы;
			нСтрока[0].КоличествоРасход  = КоличествоРасходГруппы;
			нСтрока[0].СуммаРасходПоОтчету  = СуммаРасходПоОтчетуГруппы;
			нСтрока[0].СуммаРасход  = СуммаРасходГруппы;
		КонецЕсли;
	КонецЦикла;

	
	
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	
КонецПроцедуры


Функция КодИсточникаНалоговогоНомера(ЗНАЧ НалоговыйНомер, ПлательщикЮрлицо) Экспорт
	
	НалоговыйНомер = СокрЛП(НалоговыйНомер);
	ДлинаНомера = СтрДлина(НалоговыйНомер);
	
	Результат = "";
	
	Если ДлинаНомера > 0 Тогда
		
		Если ПлательщикЮрлицо Тогда
			
			Если ДлинаНомера = 9 Тогда
				//спецплательщик
				Результат = 3;
			ИначеЕсли ДлинаНомера = 8 Тогда
				//ЕДРПОУ
				Результат = 1;
			КонецЕсли;
			
		Иначе
			
			Если ДлинаНомера = 10 Тогда
				//ДРФО
				Результат = 2;
			Иначе
				//паспорт
				Результат = 4;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция СтруктураАнтимонопольногоДокумента(ДокументСсылка,ТолькоСтруктуру)Экспорт
	
	СтруктураПоказателей = Новый Структура();
	
	СтруктураПоказателей.Вставить("Антимонопольный", Новый Структура());	// данные Антимонопольный
	СтруктураПоказателей.Антимонопольный.Вставить("Т1", Новый ТаблицаЗначений());  // данные табличной части
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G1");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G2S");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G3");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G3S");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G4");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G5");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G6");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G7");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G8");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G9");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G10");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G11");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G12");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G13");
	//СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("G14S");
	СтруктураПоказателей.Антимонопольный.Т1.Колонки.Добавить("ROWNUM");
	
	СтруктураПоказателей.Антимонопольный.Вставить("Т2", Новый ТаблицаЗначений());  // данные табличной части
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("G1");
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("G2S");
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("G3S");
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("G4");
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("G5");
	СтруктураПоказателей.Антимонопольный.Т2.Колонки.Добавить("ROWNUM");
	
	СтруктураПоказателей.Антимонопольный.Вставить("Т3", Новый ТаблицаЗначений());  // данные табличной части
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("G1");
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("G2S");
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("G3S");
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("G4");
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("G5");
	СтруктураПоказателей.Антимонопольный.Т3.Колонки.Добавить("ROWNUM");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Антимонопольный.Номер КАК Номер,
		|	Антимонопольный.Дата КАК Дата,
		|	Антимонопольный.Организация КАК Организация,
		|	Антимонопольный.ДатаНачала КАК ДатаНачала,
		|	Антимонопольный.ДатаОкончания КАК ДатаОкончания,
		|	Антимонопольный.АкцизнаяГруппа КАК АкцизнаяГруппа,
		|	Антимонопольный.АкцизнаяГруппа.Код КАК КодАкцизнойГруппы,
		|	Антимонопольный.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	Документ.Антимонопольный КАК Антимонопольный
		|ГДЕ
		|	Антимонопольный.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АнтимонопольныйТаблицаОтчета1.НомерСтроки КАК НомерСтроки,
		|	АнтимонопольныйТаблицаОтчета1.Дата КАК Дата,
		|	АнтимонопольныйТаблицаОтчета1.КодТеретории КАК КодТеретории,
		|	АнтимонопольныйТаблицаОтчета1.Контрагент КАК Контрагент,
		|	АнтимонопольныйТаблицаОтчета1.ЮрАдрес КАК ЮрАдрес,
		|	АнтимонопольныйТаблицаОтчета1.ОКПО КАК КодПоЕДРПОУ,
		|	АнтимонопольныйТаблицаОтчета1.КодАМ КАК КодАМ,
		|	АнтимонопольныйТаблицаОтчета1.КоличествоПриход КАК КоличествоПриход
		|ИЗ
		|	Документ.Антимонопольный.ТаблицаОтчета1 КАК АнтимонопольныйТаблицаОтчета1
		|ГДЕ
		|	АнтимонопольныйТаблицаОтчета1.Ссылка.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АнтимонопольныйТаблицаОтчета2.НомерСтроки КАК НомерСтроки,
		|	АнтимонопольныйТаблицаОтчета2.Дата КАК Дата,
		|	АнтимонопольныйТаблицаОтчета2.КодТеретории КАК КодТеретории,
		|	АнтимонопольныйТаблицаОтчета2.Контрагент КАК Контрагент,
		|	АнтимонопольныйТаблицаОтчета2.ЮрАдрес КАК ЮрАдрес,
		|	АнтимонопольныйТаблицаОтчета2.ОКПО КАК КодПоЕДРПОУ,
		|	АнтимонопольныйТаблицаОтчета2.КодАМ КАК КодАМ,
		|	АнтимонопольныйТаблицаОтчета2.КоличествоРасход КАК КоличествоРасход
		|ИЗ
		|	Документ.Антимонопольный.ТаблицаОтчета2 КАК АнтимонопольныйТаблицаОтчета2
		|ГДЕ
		|	АнтимонопольныйТаблицаОтчета2.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АнтимонопольныйТаблицаОтчета3.НомерСтроки КАК НомерСтроки,
		|	АнтимонопольныйТаблицаОтчета3.КодАМ КАК КодАМ,
		|	АнтимонопольныйТаблицаОтчета3.ОстатокНаНачало КАК ОстатокНаНачало,
		|	АнтимонопольныйТаблицаОтчета3.ПриходВсего КАК ПриходВсего,
		|	АнтимонопольныйТаблицаОтчета3.ПриходПроизводитель КАК ПриходПроизводитель,
		|	АнтимонопольныйТаблицаОтчета3.ПриходОпт КАК ПриходОпт,
		|	АнтимонопольныйТаблицаОтчета3.ПриходИмпорт КАК ПриходИмпорт,
		|	АнтимонопольныйТаблицаОтчета3.РасходВсего КАК РасходВсего,
		|	АнтимонопольныйТаблицаОтчета3.РасходРозница КАК РасходРозница,
		|	АнтимонопольныйТаблицаОтчета3.РасходОпт КАК РасходОпт,
		|	АнтимонопольныйТаблицаОтчета3.РасходЭкспорт КАК РасходЭкспорт,
		|	АнтимонопольныйТаблицаОтчета3.ОстатокНаКонец КАК ОстатокНаКонец,
		|	АнтимонопольныйТаблицаОтчета3.КоличествоРасходПоОтчету КАК КоличествоРасходПоОтчету,
		|	АнтимонопольныйТаблицаОтчета3.СуммаРасходПоОтчету КАК СуммаРасходПоОтчету,
		|	АнтимонопольныйТаблицаОтчета3.КоличествоРасход КАК КоличествоРасход,
		|	АнтимонопольныйТаблицаОтчета3.СуммаРасход КАК СуммаРасход
		|ИЗ
		|	Документ.Антимонопольный.ТаблицаОтчета3 КАК АнтимонопольныйТаблицаОтчета3
		|ГДЕ
		|	АнтимонопольныйТаблицаОтчета3.Ссылка.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыАкциза.Код КАК Код,
		|	ГруппыАкциза.КраткоеНаименование КАК Наименование
		|ИЗ
		|	Справочник.ГруппыАкциза КАК ГруппыАкциза";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ШапкаДокумента = РезультатЗапроса[0].Выбрать();
	ШапкаДокумента.Следующий();
	СтруктураПоказателей.Вставить("Дата",ШапкаДокумента.Дата);
	СтруктураПоказателей.Вставить("ДатаОкончания",ШапкаДокумента.ДатаОкончания);
	СтруктураПоказателей.Вставить("Номер",ШапкаДокумента.Номер);
	СтруктураПоказателей.Вставить("КодАкцизнойГруппы", ШапкаДокумента.КодАкцизнойГруппы);
	ТаблицаОтчета1 = РезультатЗапроса[1].Выгрузить();
	ТаблицаОтчета2 = РезультатЗапроса[2].Выгрузить();
	ТаблицаОтчета3 = РезультатЗапроса[3].Выгрузить();
	
	ТаблицаГруппыАкциза = РезультатЗапроса[4].Выгрузить();
	ТаблицаГруппыАкциза = Новый ТаблицаЗначений;
	ТаблицаГруппыАкциза.Индексы.Добавить("Код");
	
	РеквизитыОрганизации = Справочники.Организации.ПолучитьРеквизитыОрганизации(КонецДня(ШапкаДокумента.Дата),ШапкаДокумента.Организация);
	
	ИсточникКодаПродавца   = КодИсточникаНалоговогоНомера(РеквизитыОрганизации.КодПоЕДРПОУ, РеквизитыОрганизации.ЮрЛицо);
	
	Если  СтруктураПоказателей.Свойство("КодАкцизнойГруппы") Тогда
		Если СтруктураПоказателей.КодАкцизнойГруппы 	= "T       " Тогда
			Схема = "J0208405.XSD";
		ИначеЕсли СтруктураПоказателей.КодАкцизнойГруппы = "30      " Тогда
			Схема = "J0208206.XSD";
		Иначе
			ОбщегоНазначения.СообщитьПользователю("По данной акцизной группе не формируется отчет. Документ " + ШапкаДокумента.Номер+".");
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не заполнена акцизная группа в документе " + ШапкаДокумента.Номер+".");
		
	КонецЕсли;
	
	СтруктураПоказателей.Антимонопольный.Вставить("TIN", СокрЛП(РеквизитыОрганизации.КодПоЕДРПОУ));			
	
	ЧастиИмяРук =   ФизическиеЛицаКлиентСервер.ЧастиИмени(РеквизитыОрганизации.Руководитель);
	ЧастиИмяБух =   ФизическиеЛицаКлиентСервер.ЧастиИмени(РеквизитыОрганизации.ГлавныйБухгалтер);
	
	СтруктураПоказателей.Антимонопольный.Вставить("HZM",	Месяц(ШапкаДокумента.ДатаОкончания));
	СтруктураПоказателей.Антимонопольный.Вставить("HZY",	Год(ШапкаДокумента.Дата));
	СтруктураПоказателей.Антимонопольный.Вставить("HSTI",	"ЦЕНТРАЛЬНА ОБ'ЄДНАНА ДЕРЖАВНА ПОДАТКОВА ІНСПЕКЦІЯ М. ХАРКОВА ГОЛОВНОГО УПРАВЛІННЯ ДФС У ХАРКІВСЬКІЙ ОБЛАСТ (ЛЕНІНСЬКИЙ РАЙОН)");
	СтруктураПоказателей.Антимонопольный.Вставить("HTIN",	СокрЛП(РеквизитыОрганизации.КодПоЕДРПОУ));
	СтруктураПоказателей.Антимонопольный.Вставить("HNAME",	СокрЛП(ШапкаДокумента.ОрганизацияНаименованиеПолное));
	СтруктураПоказателей.Антимонопольный.Вставить("HLOC",	СокрЛП(РеквизитыОрганизации.Адрес));
	СтруктураПоказателей.Антимонопольный.Вставить("R00G1S",	300021);

	//
	СтруктураПоказателей.Антимонопольный.Вставить("HBOS",		""+ЧастиИмяРук.Имя +" "+ЧастиИмяРук.Фамилия+"");
	СтруктураПоказателей.Антимонопольный.Вставить("HBUH",		""+ЧастиИмяБух.Имя +" "+ЧастиИмяБух.Фамилия+"");

	// Отчет	I. Обсяги придбання та реалізації	
	Для каждого СтрокаТаблицы Из ТаблицаОтчета3 Цикл
		
		СтрокаСтруктуры = СтруктураПоказателей.Антимонопольный.Т1.Добавить();
		
		Если СтрокаТаблицы.КодАМ = "83-1" Тогда
			СтрокаСтруктуры.G1  		= "83";	
		Иначе
			СтрокаСтруктуры.G1  		= СокрЛП(СтрокаТаблицы.КодАМ);                                  //	1	Номер строки та Продукція код
		КонецЕсли;
		
		//Рита-09/08/24//
		//СтрокаСтруктуры.G2S = "описание кода "+СтрокаТаблицы.НомерСтроки;
		нстрокаТаблицы = ТаблицаГруппыАкциза.Найти(СтрокаСтруктуры.G1,"Код");
		Если нстрокаТаблицы = Неопределено Тогда
			СтрокаСтруктуры.G2S = "описание кода "+СтрокаТаблицы.НомерСтроки;                       //	2	Продукція вид
		Иначе
			СтрокаСтруктуры.G2S = нстрокаТаблицы.Наименование;
		КонецЕсли;
		Если Схема = "J0208206.XSD" Тогда	
			СтрокаСтруктуры.G3 		  	= Формат(СтрокаТаблицы.ОстатокНаНачало, "ЧДЦ=6; ЧГ=0");     //	3	Залишок продукції на початок звітного місяця
			СтрокаСтруктуры.G4  		= Формат(СтрокаТаблицы.ПриходВсего, "ЧГ=0");				//	4	Обсяги придбання усього
			СтрокаСтруктуры.G5  		= Формат(СтрокаТаблицы.ПриходПроизводитель, "ЧГ=0");   		//	5	Обсяги придбання усього у тому числі від виробника
			СтрокаСтруктуры.G6  		= Формат(СтрокаТаблицы.ПриходОпт, "ЧГ=0");             	 	//	6	Обсяги придбання усього у тому числі від підприємств оптової торгівлі
			СтрокаСтруктуры.G7     		= Формат(СтрокаТаблицы.ПриходИмпорт, "ЧГ=0");           	//	7	Обсяги придбання усьогоу тому числі за імпортом
			СтрокаСтруктуры.G8 			= Формат(СтрокаТаблицы.РасходВсего, "ЧГ=0");            	//	8	Обсяги реалізації усього
			СтрокаСтруктуры.G9 			= Формат(СтрокаТаблицы.РасходРозница, "ЧГ=0");          	//	9	Обсяги реалізації у тому числі у роздрібну торгівлю
			СтрокаСтруктуры.G10 		= Формат(СтрокаТаблицы.РасходОпт, "ЧГ=0");              	//	10	Обсяги реалізації у тому числі підприємствам оптової торгівлі
			СтрокаСтруктуры.G11 		= Формат(СтрокаТаблицы.РасходЭкспорт, "ЧГ=0");          	//	11	Обсяги реалізації у тому числі на експорт
		ИначеЕсли Схема = "J0208405.XSD" Тогда	
			СтрокаСтруктуры.G3S 		= "единица измерения";                                  	//	3	Единица измерения
			СтрокаСтруктуры.G4  		= Формат(СтрокаТаблицы.ОстатокНаНачало, "ЧДЦ=6; ЧГ=0");     //	4	Залишок продукції на початок звітного місяця
			СтрокаСтруктуры.G5  		= Формат(СтрокаТаблицы.ПриходВсего, "ЧГ=0");                //	5	Обсяги придбання усього
			СтрокаСтруктуры.G6  		= Формат(СтрокаТаблицы.ПриходПроизводитель, "ЧГ=0");        //	6	Обсяги придбання усього у тому числі від виробника
			СтрокаСтруктуры.G7     		= Формат(СтрокаТаблицы.ПриходИмпорт, "ЧГ=0");               //	7	Обсяги придбання усьогоу тому числі за імпортом
			СтрокаСтруктуры.G8 			= Формат(СтрокаТаблицы.ПриходОпт, "ЧГ=0");                  //	8	Обсяги придбання усього у тому числі від підприємств оптової торгівлі
			СтрокаСтруктуры.G9 			= Формат(СтрокаТаблицы.РасходВсего, "ЧГ=0");                //	9	Обсяги реалізації усього
			СтрокаСтруктуры.G10 		= Формат(СтрокаТаблицы.РасходРозница, "ЧГ=0");              //	10	Обсяги реалізації у тому числі у роздрібну торгівлю
			СтрокаСтруктуры.G11 		= Формат(СтрокаТаблицы.РасходОпт, "ЧГ=0");                  //	11	Обсяги реалізації у тому числі підприємствам оптової торгівлі
			СтрокаСтруктуры.G12 		= Формат(СтрокаТаблицы.РасходЭкспорт, "ЧГ=0");              //	12	Обсяги реалізації у тому числі на експорт
		КонецЕсли;
		
		СтрокаСтруктуры.G13  			= Формат(СтрокаТаблицы.ОстатокНаКонец, "ЧГ=0");             //	13	Залишок продукції на кінець звітного місяця
		//СтрокаСтруктуры.G14S  			= Истина;
		
		СтрокаСтруктуры.ROWNUM		= СтрокаТаблицы.НомерСтроки;
			
	КонецЦикла;
	
	
	// Отчет	II. Перелік контрагентів, у яких здійснювалося придбання
	Для каждого СтрокаТаблицы Из ТаблицаОтчета1 Цикл
		
		СтрокаСтруктуры = СтруктураПоказателей.Антимонопольный.Т2.Добавить();
		                                                                                      	
		СтрокаСтруктуры.G1  		= Формат(СтрокаТаблицы.КодТеретории, "ЧГ=0");            //	1	Код адміністративно-територіальної одиниці 
		СтрокаСтруктуры.G2S  		= Формат(СтрокаТаблицы.Контрагент.НаименованиеПолное);   //	2	Найменування контрагента 
		СтрокаСтруктуры.G3S 		= Формат(СтрокаТаблицы.КодПоЕДРПОУ, "ЧГ=0");     		 //	3	Код за ЄДРПОУ контрагента 
		Если СтрокаТаблицы.КодАМ = "83-1" Тогда
			СтрокаСтруктуры.G4  		= "83";					 //	4	Код продукції
		Иначе 			
			СтрокаСтруктуры.G4  		= Формат(СтрокаТаблицы.КодАМ, "ЧГ=0");					 //	4	Код продукції
		КонецЕсли;
		СтрокаСтруктуры.G5  		= Формат(СтрокаТаблицы.КоличествоПриход, "ЧГ=0") ;       //	5	Всього придбано у звітному місяці
		СтрокаСтруктуры.ROWNUM		= СтрокаТаблицы.НомерСтроки;
		
	КонецЦикла;
	
	// Отчет	III. Перелік контрагентів, яким здійснювалася реалізація
	Для каждого СтрокаТаблицы Из ТаблицаОтчета2 Цикл
		
		СтрокаСтруктуры = СтруктураПоказателей.Антимонопольный.Т3.Добавить();
		                                                                                      	
		СтрокаСтруктуры.G1  		= Формат(СтрокаТаблицы.КодТеретории, "ЧГ=0");            //	1	Код адміністративно-територіальної одиниці 
		СтрокаСтруктуры.G2S  		= Формат(СтрокаТаблицы.Контрагент.НаименованиеПолное);   //	2	Найменування контрагента 
		СтрокаСтруктуры.G3S 		= Формат(СтрокаТаблицы.КодПоЕДРПОУ, "ЧГ=0");     	     //	3	Код за ЄДРПОУ контрагента 
		Если СтрокаТаблицы.КодАМ = "83-1" Тогда
			СтрокаСтруктуры.G4  		= "83";					 //	4	Код продукції
		Иначе 			
			СтрокаСтруктуры.G4  		= Формат(СтрокаТаблицы.КодАМ, "ЧГ=0");					 //	4	Код продукції
		КонецЕсли;
		СтрокаСтруктуры.G5  		= Формат(СтрокаТаблицы.КоличествоРасход, "ЧГ=0") ;       //	5	Всього реалізовано у звітному місяці
		СтрокаСтруктуры.ROWNUM		= СтрокаТаблицы.НомерСтроки;
		
	КонецЦикла;

	Если ТолькоСтруктуру Тогда
		Возврат СтруктураПоказателей;
	КонецЕсли;
	
	
	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.УстановитьСтроку("windows-1251");
	ОбъектXML.ЗаписатьОбъявлениеXML();	
	ОбъектXML.ЗаписатьНачалоЭлемента("DECLAR");
	
	ОбъектXML.ЗаписатьНачалоАтрибута("xmlns:xsi"); 
	ОбъектXML.ЗаписатьТекст("http://www.w3.org/2001/XMLSchema-instance"); 
	ОбъектXML.ЗаписатьКонецАтрибута();
	
	ОбъектXML.ЗаписатьНачалоАтрибута("xsi:noNamespaceSchemaLocation");
	ОбъектXML.ЗаписатьТекст(Схема);
	ОбъектXML.ЗаписатьКонецАтрибута();
	
	Схема = СтрЗаменить(Схема, ".XSD", "");
	
	///DECLARHEAD	
	ОбъектXML.ЗаписатьНачалоЭлемента("DECLARHEAD");		
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.TIN, "TIN");
	ЗаписатьXML(ОбъектXML, Лев(Схема, 3), "C_DOC");
	ЗаписатьXML(ОбъектXML, Сред(Схема, 4, 3), "C_DOC_SUB");
	ЗаписатьXML(ОбъектXML, Прав(Схема, 1), "C_DOC_VER");
	ЗаписатьXML(ОбъектXML, 0, "C_DOC_TYPE");
	ЗаписатьXML(ОбъектXML, "2", "C_DOC_CNT");
	ЗаписатьXML(ОбъектXML, "20", "C_REG");
	ЗаписатьXML(ОбъектXML, "33", "C_RAJ");
	ЗаписатьXML(ОбъектXML, Месяц(СтруктураПоказателей.ДатаОкончания),"PERIOD_MONTH");
	ЗаписатьXML(ОбъектXML, 1,"PERIOD_TYPE");
	ЗаписатьXML(ОбъектXML, Год(СтруктураПоказателей.ДатаОкончания), "PERIOD_YEAR");
	ЗаписатьXML(ОбъектXML, 2033,"C_STI_ORIG");
	ЗаписатьXML(ОбъектXML, 1,"C_DOC_STAN");
	ЗаписатьXML(ОбъектXML, ,"LINKED_DOCS");
	ЗаписатьXML(ОбъектXML, Формат(СтруктураПоказателей.Дата,"ДФ=ddMMyyyy"), "D_FILL");
	ЗаписатьXML(ОбъектXML, "","SOFTWARE");
	ОбъектXML.ЗаписатьКонецЭлемента(); ///DECLARHEAD	

	
	
	///DECLARBODY	
	ОбъектXML.ЗаписатьНачалоЭлемента("DECLARBODY");
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HZM, "HZM");	
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HZY, "HZY");	
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HSTI, "HSTI");	
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HTIN, "HTIN");	
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HNAME, "HNAME");	
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HLOC, "HLOC");
	ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.R00G1S, "R00G1S");

	СоответствиеКолонок = Новый Соответствие;
	Если Схема = "J0208206" Тогда
		СоответствиеКолонок.Вставить("T1RXXXXG3", 	"G3");
	ИначеЕсли Схема = "J0208405" Тогда	
		СоответствиеКолонок.Вставить("T1RXXXXG3S", 	"G3S");
		СоответствиеКолонок.Вставить("T1RXXXXG12", 	"G12");
	КонецЕсли;
	СоответствиеКолонок.Вставить("T1RXXXXG1",	"G1");
	СоответствиеКолонок.Вставить("T1RXXXXG2S", 	"G2S");
	СоответствиеКолонок.Вставить("T1RXXXXG4", 	"G4");
	СоответствиеКолонок.Вставить("T1RXXXXG5", 	"G5");
	СоответствиеКолонок.Вставить("T1RXXXXG6", 	"G6");
	СоответствиеКолонок.Вставить("T1RXXXXG7", 	"G7");
	СоответствиеКолонок.Вставить("T1RXXXXG8", 	"G8");
	СоответствиеКолонок.Вставить("T1RXXXXG9", 	"G9");
	СоответствиеКолонок.Вставить("T1RXXXXG10", 	"G10");
	СоответствиеКолонок.Вставить("T1RXXXXG11", 	"G11");
	СоответствиеКолонок.Вставить("T1RXXXXG13", 	"G13");
	//СоответствиеКолонок.Вставить("T1RXXXXG14S", "G14S");

	Для Каждого Параметр Из СоответствиеКолонок Цикл
		Номер = 0;
		Для Каждого Стр Из СтруктураПоказателей.Антимонопольный.Т1 Цикл					
			Значение = Неопределено;
			
			Номер = Номер + 1;
			ОбъектXML.ЗаписатьНачалоЭлемента(Параметр.Ключ);											
			ОбъектXML.ЗаписатьАтрибут("ROWNUM", Формат(Номер, "ЧРД=.; ЧГ=0"));
			ОбъектXML.ЗаписатьТекст(Стр[Параметр.Значение]);						
			ОбъектXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЦикла;		
	
	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("T2RXXXXG1",	"G1");
	СоответствиеКолонок.Вставить("T2RXXXXG2S", 	"G2S");
	СоответствиеКолонок.Вставить("T2RXXXXG3S", 	"G3S");
	СоответствиеКолонок.Вставить("T2RXXXXG4", 	"G4");
	СоответствиеКолонок.Вставить("T2RXXXXG5", 	"G5");
	
	
	Для Каждого Параметр Из СоответствиеКолонок Цикл
		Номер = 0;
		Для Каждого Стр Из СтруктураПоказателей.Антимонопольный.Т2 Цикл					
			Значение = Неопределено;
			
			Номер = Номер + 1;
			ОбъектXML.ЗаписатьНачалоЭлемента(Параметр.Ключ);											
			ОбъектXML.ЗаписатьАтрибут("ROWNUM", Формат(Номер, "ЧРД=.; ЧГ=0"));
			ОбъектXML.ЗаписатьТекст(Стр[Параметр.Значение]);						
			ОбъектXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЦикла;
	
	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("T3RXXXXG1",	"G1");
	СоответствиеКолонок.Вставить("T3RXXXXG2S", 	"G2S");
	СоответствиеКолонок.Вставить("T3RXXXXG3S", 	"G3S");
	СоответствиеКолонок.Вставить("T3RXXXXG4", 	"G4");
	СоответствиеКолонок.Вставить("T3RXXXXG5", 	"G5");
	
	
	Для Каждого Параметр Из СоответствиеКолонок Цикл
		Номер = 0;
		Для Каждого Стр Из СтруктураПоказателей.Антимонопольный.Т3 Цикл					
			Значение = Неопределено;
			
			Номер = Номер + 1;
			ОбъектXML.ЗаписатьНачалоЭлемента(Параметр.Ключ);											
			ОбъектXML.ЗаписатьАтрибут("ROWNUM", Формат(Номер, "ЧРД=.; ЧГ=0"));
			ОбъектXML.ЗаписатьТекст(Стр[Параметр.Значение]);						
			ОбъектXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЦикла;

	
	//ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HBOS, "HBOS");	
	//ЗаписатьXML(ОбъектXML, СтруктураПоказателей.Антимонопольный.HBUH, "HBUH");	
	
	ОбъектXML.ЗаписатьКонецЭлемента(); ///DECLARBODY	
	ОбъектXML.ЗаписатьКонецЭлемента(); //DECLAR
	
	СтрXML = ОбъектXML.Закрыть();	
	
	
	ПотокДанных = Новый ПотокВПамяти();
	
	ЗаписьДанных = Новый ЗаписьДанных(ПотокДанных,"windows-1251");
	ЗаписьДанных.ЗаписатьСтроку(СтрXML,"windows-1251");
	ЗаписьДанных.Закрыть();
	
	ДВ = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();
	СтруктураПоказателей.Вставить("ДанныеXML",ДВ);

	СтруктураПоказателей.Вставить("ТекстXML",СтрXML);
	СтруктураПоказателей.Вставить("ИмяФайла",СокрЛП(Строка(ШапкаДокумента.Организация)) + "_" + Формат(ШапкаДокумента.Дата, "ДФ=yyyyMMdd")+"_"+ШапкаДокумента.Номер+"_АМ.xml"); 
	
	Возврат СтруктураПоказателей;

КонецФункции

Функция СформироватьАнтимонопольный(МассивДокументов,ТолькоСтруктуру=Ложь)Экспорт
	
	МассивВозврата = Новый Массив;
	
	
	Для Индекс = 0 ПО МассивДокументов.ВГраница() Цикл
		
		Документ = МассивДокументов[Индекс];
		
		СтруктруаДокумента = СтруктураАнтимонопольногоДокумента(Документ,ТолькоСтруктуру);
		МассивВозврата.Добавить(Новый Структура("Документ,Выгрузка",Документ,СтруктруаДокумента));
		
	КонецЦикла;
	
	
	Возврат МассивВозврата;
	
КонецФункции
